In [3]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [7]:
mba = pd.read_csv("C:\\Users\\nikhi\\OneDrive\\Desktop\\Social Prachar\\Excel files\\mba.csv")
mba

     Datasrno  workex  gmat
0           1      21   720
1           2     107   640
2           3      57   740
3           4      99   690
4           5     208   710
..        ...     ...   ...
768       769      88   620
769       770     132   670
770       771      28   610
771       772      10   610
772       773      52   620

[773 rows x 3 columns]

In [8]:
del mba['Datasrno']

In [9]:
mba

     workex  gmat
0        21   720
1       107   640
2        57   740
3        99   690
4       208   710
..      ...   ...
768      88   620
769     132   670
770      28   610
771      10   610
772      52   620

[773 rows x 2 columns]

In [10]:
mba = pd.read_csv("C:\\Users\\nikhi\\OneDrive\\Desktop\\Social Prachar\\Excel files\\mba.csv")
mba

     Datasrno  workex  gmat
0           1      21   720
1           2     107   640
2           3      57   740
3           4      99   690
4           5     208   710
..        ...     ...   ...
768       769      88   620
769       770     132   670
770       771      28   610
771       772      10   610
772       773      52   620

[773 rows x 3 columns]

In [11]:
len(mba)

773

In [12]:
len(mba.columns)

3

In [13]:
mba.shape

(773, 3)

In [14]:
mba.columns

Index(['Datasrno', 'workex', 'gmat'], dtype='object')

In [15]:
mba.dtypes

Datasrno    int64
workex      int64
gmat        int64
dtype: object

In [18]:
mba.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 773 entries, 0 to 772
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Datasrno  773 non-null    int64
 1   workex    773 non-null    int64
 2   gmat      773 non-null    int64
dtypes: int64(3)
memory usage: 18.2 KB

In [19]:
mba.head()

   Datasrno  workex  gmat
0         1      21   720
1         2     107   640
2         3      57   740
3         4      99   690
4         5     208   710

In [20]:
mba.tail()

     Datasrno  workex  gmat
768       769      88   620
769       770     132   670
770       771      28   610
771       772      10   610
772       773      52   620

In [21]:
mba.describe()

        Datasrno     workex        gmat
count  773.00000  773.00000  773.000000
mean   387.00000   57.50194  711.164295
std    223.29017   27.38682   29.339714
min      1.00000    9.00000  600.000000
25%    194.00000   41.00000  690.000000
50%    387.00000   52.00000  710.000000
75%    580.00000   69.00000  730.000000
max    773.00000  279.00000  780.000000

In [22]:
# To convert rows into columns
mba.describe().transpose()

          count        mean         std    min    25%    50%    75%    max
Datasrno  773.0  387.000000  223.290170    1.0  194.0  387.0  580.0  773.0
workex    773.0   57.501940   27.386820    9.0   41.0   52.0   69.0  279.0
gmat      773.0  711.164295   29.339714  600.0  690.0  710.0  730.0  780.0

In [23]:
mba['gmat']

0      720
1      640
2      740
3      690
4      710
      ...
768    620
769    670
770    610
771    610
772    620
Name: gmat, Length: 773, dtype: int64

In [24]:
mba.mean()

Datasrno    387.000000
workex       57.501940
gmat        711.164295
dtype: float64

In [25]:
mba['gmat'].mean()

711.1642949547219

In [26]:
mba.std()

Datasrno    223.290170
workex       27.386820
gmat         29.339714
dtype: float64

In [27]:
mba.var()

Datasrno    49858.500000
workex        750.037885
gmat          860.818827
dtype: float64

In [28]:
mba.min()

Datasrno      1
workex        9
gmat        600
dtype: int64

In [29]:
mba.max()

Datasrno    773
workex      279
gmat        780
dtype: int64

In [30]:
mba.median()

Datasrno    387.0
workex       52.0
gmat        710.0
dtype: float64

In [33]:
mba['gmat'].mode()

0    710
dtype: int64

In [34]:
 mba['workex'].mode()

0    45
dtype: int64